{"head":{"title":"Et pourtant elle tourne ! (ma roue en SVG)","published":"2016-02-01T00:00:00.000Z","collection":"articles","layout":"Post","draft":false,"js":["loterie-1"],"css":["roue-fortune"],"soundCloud":33201372,"siteDescription":"un module javascript et svg d'un jeu de loterie, personnalisable","excerpt":{"text":"Comment un test sur la rotation d'un objet finit par produire un petit jeu…","photo":"img/rot-roue_de_la_fortune.png","photoAlt":"roue de loterie"},"description":"Au départ, ce simple exercice d’animatique aurait pu être réalisé avec Flash, mais Flash est mort. Les navigateurs qui s'appuyaient dessus…"},"body":"<p>Au départ, ce simple exercice d’animatique aurait pu être réalisé avec Flash, mais Flash est mort. Les navigateurs qui s'appuyaient dessus ne pourront d'ailleurs pas lire cette version en SVG, une version dégradée est prévue dans ce  cas.</p>\n<p>Quitte à faire tourner la roue, autant poursuivre en donnant la possibilité de la  personnaliser. Voici comment définir les lots anisi que le nombre de portions.</p>\n<div id=\"cible2\" ></div>\n<!--intro-->\n<h2 id=\"comment-utiliser-la-roue\">Comment utiliser la roue</h2>\n<p>Le  mode d'emploi est intuitif : tirer la targette plus ou moins fortement, et relâcher pour faire tourner la roue. Le lot gagnant est ensuite annoncé. Et on recommence !</p>\n<p><strong>La liste de lots est personnalisable.</strong> Pour chaque lot, Il faut renseigner un label qui contient la valeur du lot, par exemple : « 500€ », « cadeau », « Trek 7j. ». Ils doivent être courts, pas plus d’une dizaine de caractères.</p>\n<p>Il faut aussi renseigner une couleur à attribuer au fond de la portion, sous forme d’un nom css<a href=\"#note01\">1</a>  ou d‘une couleur hexadécimale.</p>\n<pre><code class=\"hljs language-javascript\">    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"100€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#5078ff\"</span>}</code></pre>\n<p> En option, d’autres infos peuvent être ajoutées, comme un message en cas de gain.</p>\n<p>Il existe deux façons de transmettre cette liste : la  plus simple  étant de lister chaque lot un par un :</p>\n<pre><code class=\"hljs language-javascript\">  lot: [\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"100€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#5078ff\"</span> },\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"200€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#6262be\"</span> },\n    <span class=\"hljs-comment\">// etc</span>\n    ]</code></pre>\n<p>Cependant, il est courant dans ce type de jeu de multiplier un même lot, alors que le gros lot n’y sera qu’une seule fois. Plutôt que de dupliquer le même lot,  il suffit d’indiquer pour chacun la quantité voulue. La liste ressemble alors à ceci :</p>\n<pre><code class=\"hljs language-javascript\">  lot:[\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"100€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#5078ff\"</span>, quantité:<span class=\"hljs-number\">6</span> },\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"200€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#6262be\"</span>, quantité:<span class=\"hljs-number\">3</span> },\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"500€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#cc26a0\"</span>, quantité:<span class=\"hljs-number\">1</span> },\n    <span class=\"hljs-comment\">// etc</span>\n    ] ;</code></pre>\n<p>Il est possible de définir un nombre total de portions plus élevé ; dans ce cas, un élément supplémentaire est défini à part, qui sera utilisé comme remplissage par défaut :</p>\n<pre><code class=\"hljs language-javascript\">lots = {\n  <span class=\"hljs-attr\">portions</span>: <span class=\"hljs-number\">20</span>,\n  <span class=\"hljs-attr\">defaut</span>: {<span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"Perdu\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#87af1b\"</span>},\n  <span class=\"hljs-attr\">lot</span>: [\n    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"100€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#5078ff\"</span>, quantité:<span class=\"hljs-number\">6</span> },\n    <span class=\"hljs-comment\">// etc</span>\n   ]\n}</code></pre>\n<p>Dans cet exemple, la roue est divisée en 20 portions, les lots sont répartis selon la quantité demandée. Le restant de places est rempli par la valeur « défaut » de façon homogène et aléatoire.</p>\n<h2 id=\"tricher--ou-pas\">Tricher ? ou pas.</h2>\n<p>Dans le cas où les lots en jeu sont en quantité limitée, il est nécessaire d’empêcher de sortir un lot déjà gagné dans un précédent tirage. La gestion des lots n’est pas le sujet de ce module, et devrait être traité coté serveur ; cependant, il est prévu une possibilité de bloquer la sortie d’un lot en ajoutant un drapeau :</p>\n<pre><code class=\"hljs language-javascript\">    { <span class=\"hljs-attr\">label</span>: <span class=\"hljs-string\">\"100€\"</span>, <span class=\"hljs-attr\">couleur</span>: <span class=\"hljs-string\">\"#5078ff\"</span>, quantité:<span class=\"hljs-number\">6</span>, <span class=\"hljs-attr\">gain</span>:<span class=\"hljs-number\">0</span> }</code></pre>\n<p>Dans cette logique, forcer tous les lots, sauf un, à « gain:0 » reviendra à désigner à l’avance un lot gagnant…\nPlus simplement,  une option permet de passer un paramètre  pour désigner à l’avance le lot gagnant ; dans ce cas, le mécanisme de tirage au sort est effectué coté serveur, et ce module ne sert qu'à l’animation.</p>\n<h2 id=\"comment-intégrer-ce-module\">Comment intégrer ce module</h2>\n<p>La fonction n’a pas de dépendances ; elle s’appelle par un constructeur :</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">var</span> roue = <span class=\"hljs-keyword\">new</span> roueFortune( id, listeLots, [ lotGagnant, callback  ]  ) ;</code></pre>\n<ul>\n<li>\n<p>où « id » désigne la balise conteneur où sera créé la roue,\n« listeLots » est soit un tableau listant les lots, soit un objet définissant la nature des lots et leur quantité.</p>\n</li>\n<li>\n<p>« lotGagnant » est l’index du lot désigné comme gagnant dans la liste  ; il faut noter que cette valeur ne fonctionnera pas si la liste est passée comme un objet, car les lots y sont distribués aléatoirement. Il faut utiliser le parterre « gain » dans ce cas.</p>\n</li>\n<li>\n<p>« callback » est une fonction qui récupère l’élément gagnant de la liste ; elle est destinée à générer, par exemple, une animation de victoire, ou de perte, c’est vous qui voyez. Elle est prioritaire sur l’animation par défaut.</p>\n</li>\n</ul>\n<p>A noter, il est possible d’ajouter d’autres informations à la liste, qui seront utilisées par la callback :</p>\n<pre><code class=\"hljs language-javascript\">   {<span class=\"hljs-attr\">label</span>:<span class=\"hljs-string\">\"500€\"</span>, <span class=\"hljs-attr\">description</span>:<span class=\"hljs-string\">\"Bravo !  vous avez gagné le gros lot.\"</span>, <span class=\"hljs-attr\">quantite</span>:<span class=\"hljs-number\">6</span>, <span class=\"hljs-attr\">couleur</span>:<span class=\"hljs-string\">\"#5078ff\"</span>, <span class=\"hljs-attr\">gain</span>:<span class=\"hljs-number\">1</span>}</code></pre>\n<p>  « description » sera utilisé pour adresser un mot de félicitations.\nLa fonction crée pour chaque portion une classe CSS dédiée qui est ajoutée à l’objet lot ; cela permet, par exemple de faire clignoter le lot gagnant sur la roue.</p>\n<h2 id=\"compatibilité\">Compatibilité</h2>\n<p>Le support est étendu aux navigateurs qui reconnaissent le svg, soit la plupart des navigateurs récents et mobiles, mais pas les anciens IE, pour lesquels ce type d’animation était généralement traité par Flash. Un fallback est prévu pour ces navigateurs. On peut forcer l'activation sur les autres en nommant l'id du conteneur \"legacy\".</p>\n<h2 id=\"coté-technique\">Coté technique</h2>\n<ul>\n<li>Conçu comme un module autonome : plusieurs roues peuvent être utilisées sur une même page. pas de dépendance à une librairie js.</li>\n<li>Le rendu de la roue est personnalisable par css ;</li>\n<li>On l’a vu, des données personnalisables.</li>\n</ul>\n<h1 id=\"quelques-remarques\">Quelques remarques</h1>\n<h2 id=\"firefox-capricieux-avec-svg\">Firefox, capricieux avec SVG.</h2>\n<p>L’implémentation du SVG n’est pas homogène et souffre de nombreux bugs. Pour ce qui concerne la simple rotation d’un objet, chaque navigateur propose sa propre solution… s’il en existe une !\nSur Firefox (&#x3C;43), la propriété transform-origin est ignorée : la roue ne tourne plus sur son axe <a href=\"#note02\">2</a> !</p>\n<p>Ce bug est connu<a href=\"#note3\">3</a> et son contournement nécessite quelques astuces. La roue doit être incorporée dans une balise englobante, sur laquelle va être appliquée la propriété transform-origin, avec pour valeurs « 50% 50% », c’est à dire son point central. Par héritage, cet axe sera utilisé par l’objet englobé sur lequel sera appliquée la rotation.</p>\n<pre><code class=\"hljs language-svg\">&#x3C;g <span class=\"hljs-keyword\">class</span>=<span class=\"hljs-string\">\"ff-correct\"</span>> \t<span class=\"hljs-comment\">//  -moz-transform: translate(100px, 100px) ;</span>\n\t&#x3C;g id=<span class=\"hljs-string\">\"cible-roue\"</span> <span class=\"hljs-keyword\">class</span>=<span class=\"hljs-string\">\"wheel\"</span>>  <span class=\"hljs-comment\">// transform-origin: center center;</span>\n\t\t&#x3C;g <span class=\"hljs-keyword\">class</span>=<span class=\"hljs-string\">\"ff-c-correct\"</span>>  <span class=\"hljs-comment\">// -moz-transform: translate(-100px, -100px);</span>\n\t\t\t<span class=\"hljs-comment\">// -moz-transform-origin: 0 0;</span>\n\t\t<span class=\"hljs-comment\">// code de la roue</span>\n\t\t&#x3C;/g>\n\t&#x3C;/g>\n&#x3C;/g></code></pre>\n<p>Safari perd ses repères lorsque le zoom est actif, quant à IE, il ignore tout simplement les propriétés transform appliquées au SVG.</p>\n<p>Quand ça fonctionne, les performances ne sont pas au rendez-vous : si les versions desktop donnent le change, l’affichage sur mobile est franchement poussif et se dégrade très vite si l’on augmente le nombre de portions.\n<em>Et pourtant elle tourne…</em></p>\n<p>La meilleure solution est finalement de créer une div qui contiendra le SVG. sur la quelle sera appliquée la rotation. Miracle, les performances sont retrouvées, les incompatibilités disparues !</p>\n<h2 id=\"réinitialiser-une-transition\">Réinitialiser une transition</h2>\n<p>L’animation de la roue est une simple transition CSS, qui produit une rotation selon un angle calculé à partir du tirage au sort.</p>\n<pre><code class=\"hljs language-css\">  <span class=\"hljs-selector-tag\">wheel</span> { <span class=\"hljs-attribute\">transition</span>: transform <span class=\"hljs-number\">4s</span> <span class=\"hljs-built_in\">cubic-bezier</span>(.36, -0.09, .23, .99)  ; }</code></pre>\n<p>La transition est déclenchée en ajoutant un style en-ligne :</p>\n<pre><code class=\"hljs language-html\"><span class=\"hljs-tag\">&#x3C;<span class=\"hljs-name\">div</span> <span class=\"hljs-attr\">id</span>=<span class=\"hljs-string\">\"cible2-roue\"</span> <span class=\"hljs-attr\">style</span>=<span class=\"hljs-string\">\"transform: rotateZ(300deg);\"</span>></span></code></pre>\n<p> ce qui évite de modifier dynamiquement les déclarations css.</p>\n<p>Le nombre de tours est calculé en multipliant ce nombre par 360 ; pour une valeur de 1600 degrés par exemple, cela représentera  4 x 360 plus 160°, soit 4 tours complets plus le déplacement vers le lot gagnant.</p>\n<p>Si, au tirage suivant, la rotation fait seulement 3 tours par exemple, la roue va tourner… à reculons ! il est nécessaire de retirer les tours complets, mais tout changement de valeur re-enclenchera une animation. L’astuce va consister à modifier la durée de transition pour qu’elle soit extrêmement brève et imperceptible.</p>\n<p>Cela fonctionne très bien la première fois, mais la transition doit être remise à zéro pour fonctionner les fois suivantes. Il ne suffit pas de supprimer et réattribuer la classe supportant la transition.</p>\n<p>Le truc consiste à modifier la durée de transition, en la passant à une fraction de seconde, le temps de mettre une valeur de rotation débarrassée de ses tours superflus. Le mouvement est imperceptible.</p>\n<h2 id=\"bilan-technique\">Bilan technique</h2>\n<p>Ce projet m’a fait découvrir quelques rouages de l’animation avec javascript, sans l’aide d’une librairie. J’ai passé beaucoup de temps à détecter et contourner les bugs d’une animation très simple, pour aboutir à utiliser un simple élément html pour le faire. Pour de prochains projets, le recours à une bibliothèque est quasi-obligatoire.</p>\n<p>SVG est une norme très ancienne, qui devient populaire à mesure que les derniers navigateurs l’ignorant disparaissent. J’ai depuis longtemps préféré utiliser le vectoriel au pixel pour la création de maquettes, cette approche est désormais celle du web responsive. Malheureusement, la construction d’une animation basée sur SVG est freinée par des bugs non résolus, sur des opérations somme toute assez courantes.</p>\n<p>La modification à la volée d’une animation css par javascript souffre de ne pas utiliser d’API. Celles ci commencent à peine à apparaitre, et ne seront sans doute pas finalisées avant quelque temps : il faut encore utiliser nombre de hacks et prefixes vendeurs pour modifier quoi que ce soit. Les transitions sont plus simples à gérer et convienne parfaitement pour ce projet.  </p>\n<p>Le recours à une librairie spécialisée comme Velocity.js ou Greensock est nécessaire pour des projets plus complexes, sans pouvoir tout résoudre.</p>\n<h2 id=\"connecter-le-module-à-un-gestionnaire-en-back-end\">Connecter le module à un gestionnaire en back-end</h2>\n<p>En cas d’usage comme un jeu-concours, la sécurité d'un tel module ne peut etre assurée que par un système en back-end. Ses principales fonctions seraient :</p>\n<ul>\n<li>authentifier l’utilisateur pour éviter un usage abusif du jeu ;</li>\n<li>limiter l’usage à un nombre déterminé de tirages, ainsi qu’un délai avant de  tenter un nouvel essai ;</li>\n<li>contrôler les lots mis en jeu : la liste peut être générée par le back-end, qui sera informé des stocks de lots disponibles.</li>\n</ul>\n<p>Par exemple, un seul gros lot est gagnable par jour ; il doit être visible dans le jeu, mais il ne peut être gagné qu’une seule fois ; le drapeau permet de gérer le cas. Sauf à forcer le gain, il reste soumis à un tirage au sort.</p>\n<h2 id=\"dautres-usages\">D'autres usages</h2>\n<p>Comme ce module est personnalisable, il est possible de trouver un usage dans tout jeu qui utilise le tirage au sort.\nEn ajoutant une interface de saisie pour les lots, on pourra, par exemple, s’en servir pour des petits jeux de gages… pour prochain gouter d’anniversaire de ma fille !</p>\n<aside class=\"notes\">\n<h2>Notes</h2>\n<ul>\n<li id=\"note01\">\n<p>Les noms de couleurs en <a href=\"https://fr.wikipedia.org/wiki/Couleur_du_Web\">css</a>. Connaissez-vous l'histoire tragique de <a href=\"http://meyerweb.com/eric/thoughts/2014/06/19/rebeccapurple/\">rebeccapurple</a> ?</p>\n</li>\n<li id=\"note02\">\n<p>voir l’article <a href=\"https://css-tricks.com/svg-animation-on-css-transforms/\">css-tricks</a>.</p>\n</li>\n<li id=\"note03\">\n<p>le bug de firefox sur <a href=\"http://stackoverflow.com/questions/15139090/setting-transform-origin-on-svg-group-not-working-in-firefox\">stackoverflow</a>.</p>\n</li>\n</ul>\n</aside>\n","__filename":"articles/et-pourtant-elle-tourne.md","__url":"/articles/et-pourtant-elle-tourne/","__resourceUrl":"/articles/et-pourtant-elle-tourne/index.html","__dataUrl":"/articles/et-pourtant-elle-tourne/index.html.2a8af35eeceda1d0bdb5e1422816dcfe.json"}