{"head":{"title":"Construire votre site, en trois grandes étapes","titleStyle":"AltTitre","layout":"Post","listPosts":false,"siteDescription":"Construire votre site en trois grandes étapes","description":"Votre site ne vous donne plus entière satisfaction, vous envisagez une refonte ; ou au contraire, vous portez un tout nouveau projet ? Vous…"},"body":"<p>Votre site ne vous donne plus entière satisfaction, vous envisagez une refonte ; ou au contraire, vous portez un tout nouveau projet ? Vous êtes accompagnés dans chaque étape.</p>\n<p><img src=\"../assets/img/conception-web_DSC_0085.jpg\" alt=\"étude graphique d’un site\" title=\"étude graphique d’un site\"></p>\n<!--intro-->\n<h2 id=\"avant-la-construction\">Avant la construction</h2>\n<p>Après exposition du projet et la définition des objectifs que vous aurez determiné, l’arborescence du site est produite.\nLes contenus texte, video, photos, logo, sont recueillis ou créés au besoin.\nLes composants fonctionnels sont identifiés : formulaires, cartes, carousel…\nNous en tirons les lignes conductrices pour construire le propos de la page d’accueil.</p>\n<p>Vous avez réuni ces éléments, nous pouvons construire le site.</p>\n<h2 id=\"la-réalisation-du-site\">La réalisation du site</h2>\n<p>Cette partie commence par la création d'un thème visuel unique qui sera ensuite codé. Dans certains cas, il sera possible d’utiliser un thème déjà réalisé qui sera personnalisé.\nLes pages créées sont révisées et validées au fur et à mesure. Après d’ultimes révisions, le site est livré.</p>\n<h2 id=\"améliorer-le-site\">Améliorer le site</h2>\n<p>Il est avantageux de penser l’optimisation du site dès sa conception Plusieurs types d’améliorations peuvent se combiner ensemble pour de meilleurs résultats :</p>\n<ul>\n<li>optimisation pour le référencement naturel (SEO),</li>\n<li>optimisation pour l’accessibilité, prise en compte des handicaps… et des robots d’indexation.</li>\n<li>optimisation du temps de chargement des pages (minification, AMP, cache, cdn…)</li>\n<li>sécurisation avancée du site (https, htaccess).</li>\n</ul>\n<h2 id=\"entretien\">Entretien</h2>\n<p>Le suivi de correction des bugs, l’archivage et les mise à jours sont assurés trois mois après la publication du site. Au delà, un plan de maintenance est proposé ; une formation est possible si vous souhaitez vous en charger vous même.</p>\n<p>Vous avez un projet ? <a href=\"../contact\">Parlons-en ensemble !</a></p>\n","__filename":"services.md","__url":"/services/","__resourceUrl":"/services/index.html","__dataUrl":"/services/index.html.ff512ba93c961f831c8bbc3f8b03f9e3.json"}