{"head":{"title":"Crop-manager, un composant React","date":"2017-08-01T00:00:00.000Z","collection":"reference","layout":"Post","draft":false,"soundCloud":119194573,"siteDescription":"crop-manager, un composant React pour le recadrage d'images","excerpt":{"text":"Crop-manager est un nouveau composant javascript dédié au recadrage d'image dans votre navigateur, simple et performant. ","photo":"img/motif-crop-manager.jpg","photoAlt":"recadrer rapidement des images avec crop-manager"},"description":"Crop-manager est un composant React dédié au recadrage d’images directement dans le navigateur. Complet, il permet de traiter rapidement…"},"body":"<p>Crop-manager est un composant React dédié au recadrage d’images directement dans le navigateur.\nComplet, il permet de traiter rapidement une image de façon intuitive.</p>\n<p><a href=\"http://vitreene.com/crop-manager\" class=\"post-boutonCta\"> découvrez crop-manager </a></p>\n<p><img src=\"../../assets/img/motif-logo-crop-manager.jpg\" alt=\"recadrer rapidement des images avec crop-manager\"></p>\n<!--intro-->\n<p>Son usage est très simple : l’image se manipule à la souris, la touche shift permet de passer du mode déplacement au mode échelle / rotation. Sur les appareils tactiles, ces memes opérations se font à un ou deux doigts.</p>\n<h2 id=\"les-fonctionnalités\">Les fonctionnalités</h2>\n<ul>\n<li>déplacement, mise à l’échelle et rotation libres,</li>\n<li>symétrie horizontale et verticale, basculement,</li>\n<li>cadrages prédéfinis.</li>\n<li>rendu optimisé par accentuation de la netteté.</li>\n<li>support tactile</li>\n<li>éditeur responsive, l’image éditée utilise toute la surface disponible, indépendamment de ses dimensions propres.</li>\n</ul>\n<p>crop-manager opère entièrement dans le navigateur. Les données de cadrage sont disponibles pour un traitement coté serveur.</p>\n<h2 id=\"limage-et-le-cadrage-sont-liés\">L’image et le cadrage sont liés.</h2>\n<p><strong>Le cadre</strong> est défini par une <strong>dimension</strong> et un <strong>ratio</strong>. Par convention, la dimension est établie comme la diagonale de l’image ; le ratio est une valeur fixée par l’utilisateur. Dimension et ratio donnent les proportions initiales du cadre. Le cadre et l’image sont alignés sur leur <strong>point central</strong>.</p>\n<p><strong>Le cadrage</strong> est le résultat de la  transformation appliquée à l’image sur cette base : échelle, rotation et translation, exprimée en pourcentages. </p>\n<p>Les dimensions relatives permettent d’utiliser des sources de différentes tailles, légères coté utilisateur, et complètes coté serveur. Seules les données de cadrage sont transmises.</p>\n<p>Les valeurs du cadre données en pixels servent au rendu final. Seul le ratio largeur/hauteur est employé par le module. Cela autorise à générer simplement plusieurs rendus d’échelle différentes.</p>\n<p><a href=\"http://vitreene.com/crop-manager\">La demo de crop-manager</a></p>\n<p><a href=\"https://github.com/vitreene/crop-manager\">La source de l'app sur Github</a></p>\n<p><strong>Vous avez des remarques ou des idées pour améliorer ce composant ?\n<a href=\"../contact\">N'hésitez pas à m'en parler.</a></strong></p>\n","__filename":"articles/crop-manager-presntation.md","__url":"/articles/crop-manager-presntation/","__resourceUrl":"/articles/crop-manager-presntation/index.html","__dataUrl":"/articles/crop-manager-presntation/index.html.a40431b2928208bf40b3de44ab872007.json"}