{"head":{"title":"Wordpress : protéger l’accès d’une page par mot de passe","published":"2017-07-03T00:00:00.000Z","date":"2017-07-03T00:00:00.000Z","collection":"articles","layout":"Post","draft":false,"soundCloud":33200703,"siteDescription":"Wordpress: protéger l’accès d’une page par mot de passe.","excerpt":{"text":"Retour sur l’utilisation de cette fonction un peu oubliée","photo":"img/WP-prtected_DSC_0079.jpg","photoAlt":"Protéger sa page par un code d’accès."},"description":"Pour la refonte du site d’un client, j’ai eu besoin de créer une page contenant un accès simplifié à ses activités. Il souhaitait en…"},"body":"<p>Pour la refonte du site d’un client, j’ai eu besoin de créer une page contenant un accès simplifié à ses activités. Il souhaitait en réserver l’accès à ses collaborateurs, aussi cette page n’est pas liée au reste du site. </p>\n<p><img src=\"../../assets/img/WP-prtected_DSC_0079.jpg\" alt=\"page protégée\" title=\"page protégée\"></p>\n<!--intro-->\n<p>La page ne contient pas d’informations sensibles, mais il n’est pas souhaitable que l’on puisse la consulter accidentellement. </p>\n<p>Wordpress propose depuis très longtemps de protéger une page par mot de passe. Le niveau de sécurité n’est pas très élevé, mais largement suffisant pour ce cas.\nDu coté de l’administration, dans les options de publication d’une page ou d’un post, l’option de visibilité doit être réglée à « protection par mot de passe » Au meme endroit, un champ renseigne le mot de passe.</p>\n<p>Et cela fonctionne… en principe. Car si le mot de passe est bien demandé, la majeure partie du contenu de cette page apparait quand même. Que se passe-t-il ?</p>\n<h2 id=\"protéger-les-contenus-personnalisés\">Protéger les contenus personnalisés</h2>\n<p>Le tableau de mon client est créé à partir d’un contenu personnalisé, ajouté en fin du template. La protection ne contrôle, par défaut, que les contenus standard de Wordpress : le titre, le contenu, et le résumé. </p>\n<p>Il faut intervenir dans le template de la page et demander à Wordpress de vérifier si un mot de passe est requis pour cette page, c’est l’objet de la fonction <em>post_password_required()</em> qui retournera true ou false.\nLa page du codex<a href=\"#note01\">1</a>. consacrée à cette fonction manque d’exemple sur l’emploi de la fonction.  </p>\n<p>Après quelques tests, il suffit d’encadrer le contenu personnalisé par une condition, et demander d’afficher à la place le formulaire du mot de passe tant que la condition n’est pas remplie : </p>\n<pre><code class=\"hljs language-php\"><span class=\"hljs-meta\">&#x3C;?php</span> \n<span class=\"hljs-keyword\">if</span> ( post_password_required() ) :\n    <span class=\"hljs-keyword\">echo</span> get_the_password_form();\n<span class=\"hljs-keyword\">else</span> : <span class=\"hljs-meta\">?></span>\n  … contenu…\n<span class=\"hljs-meta\">&#x3C;?php</span> <span class=\"hljs-keyword\">endif</span>; <span class=\"hljs-meta\">?></span></code></pre>\n<p>Plus simple encore : si la page utilise les fonctions, <em>the_title()</em> ou <em>the_content()</em>, elle vont déclencher automatiquement l’apparition du formulaire.\nSur la page du codex, se trouve les options permettant de personnaliser le formulaire et les messages d’avertissement.</p>\n<p>Cette fonction ancienne et un peu oubliée garde de l’intérêt par sa simplicité de mise en oeuvre (pas de plugin, disponible par défaut) et se justifie si l’on a besoin d’un simple cadenas plutôt que d’un coffre-fort !</p>\n<aside class=\"notes\">\n<h2>Notes</h2>\n<ul>\n<li id=\"note01\">\n<p>Codex Wordpress : <a href=\"https://codex.wordpress.org/Using_Password_Protection\">using password protection</a></p>\n</li>\n</ul>\n</aside>\n","__filename":"articles/wp-page-protegee.md","__url":"/articles/wp-page-protegee/","__resourceUrl":"/articles/wp-page-protegee/index.html","__dataUrl":"/articles/wp-page-protegee/index.html.af7d99d4f3c3e1c0a3c542a5fe35c64f.json"}